app/controllers/nonfull_days_controller.rb

UPDATE "users" SET "child_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["child_count", 3], ["updated_at", "2017-05-22 17:12:46.143107"], ["id", 20]]
---
  def index
    @user = current_user
    @user.update_attributes(:child_count => params[:interval])

UPDATE "users" SET "plan_name" = $1, "last_name" = $2, "primary_phone" = $3, "parent_name" = $4, "plan" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["plan_name", "nonfull"], ["last_name", "ff"], ["primary_phone", "ff"], ["parent_name", "fff"], ["plan", "1"], ["updated_at", "2017-05-22 18:34:09.568750"], ["id", 22]]
---
  def update
    @user = current_user
    if params[:user][:plan_name].present? && params[:user][:interval].present?
      @user.attributes = person_params.merge(plan: params[:user][:interval], plan_name: params[:user][:plan_name],)
    else
      @user.attributes = person_params.merge(child_name: params[:user][:child_name].present? ? params[:user][:child_name] : nil)
    end
    @user.attributes = person_params.merge(child_name: params[:user][:child_name].present? ? params[:user][:child_name] : nil)
    if @user.save