app/controllers/nonhalf_days_controller.rb

  def index
    @user = current_user
    @user.update_attributes(:child_count => params[:interval])
---
UPDATE "users" SET "child_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["child_count", 1], ["updated_at", "2017-05-22 20:09:48.176512"], ["id", 24]]

  def update
    @user = current_user
    if params[:user][:plan_name].present? && params[:user][:interval].present?
      @user.attributes = person_params.merge(plan: params[:user][:interval], plan_name: params[:user][:plan_name],)
    else
      @user.attributes = person_params.merge(child_name: params[:user][:child_name].present? ? params[:user][:child_name] : nil)
    end
    @user.attributes = person_params.merge(child_name: params[:user][:child_name].present? ? params[:user][:child_name] : nil)
    if @user.save
---
UPDATE "users" SET "plan_name" = $1, "last_name" = $2, "primary_phone" = $3, "parent_name" = $4, "plan" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["plan_name", "nonhalf"], ["last_name", "dff"], ["primary_phone", "fff"], ["parent_name", "ddd"], ["plan", "1"], ["updated_at", "2017-05-22 20:10:10.297990"], ["id", 24]]