app/controllers/wffhalf_days_controller.rb

UPDATE "users" SET "child_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["child_count", 1], ["updated_at", "2017-05-22 17:17:49.787896"], ["id", 21]]
---
  def index
    @user = current_user
    @user.update_attributes(:child_count => params[:interval])

UPDATE "users" SET "plan_name" = $1, "plan" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["plan_name", "wffhalf"], ["plan", "1"], ["updated_at", "2017-05-22 17:17:55.786147"], ["id", 21]]
---
  def update
    @user = current_user
    if params[:user][:plan_name].present? && params[:user][:interval].present?
      @user.attributes = person_params.merge(plan: params[:user][:interval], plan_name: params[:user][:plan_name],)
    else
      @user.attributes = person_params.merge(child_name: params[:user][:child_name].present? ? params[:user][:child_name] : nil)
    end
    @user.attributes = person_params.merge(child_name: params[:user][:child_name].present? ? params[:user][:child_name] : nil)
    if @user.save