app/controllers/wffull_days_controller.rb

UPDATE "users" SET "child_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["child_count", 2], ["updated_at", "2017-05-22 07:51:28.364440"], ["id", 18]]
---
  def index
    @user = current_user
    @user.update_attributes(:child_count => params[:interval])

UPDATE "users" SET "plan_name" = $1, "last_name" = $2, "primary_phone" = $3, "parent_name" = $4, "plan" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["plan_name", "wffull"], ["last_name", "ss"], ["primary_phone", "ss"], ["parent_name", "ss"], ["plan", "1"], ["updated_at", "2017-05-22 08:06:42.421647"], ["id", 19]]
---
  def update
    @user = current_user
    if params[:user][:plan_name].present? && params[:user][:interval].present?
      @user.attributes = person_params.merge(plan: params[:user][:interval], plan_name: params[:user][:plan_name],)
    else
      @user.attributes = person_params.merge(child_name: params[:user][:child_name].present? ? params[:user][:child_name] : nil)
    end
    @user.attributes = person_params.merge(child_name: params[:user][:child_name].present? ? params[:user][:child_name] : nil)
    if @user.save